[
  {
    "sender": "user",
    "text": "hello"
  },
  {
    "sender": "ai",
    "text": "Hey! How are you doing today?\n"
  },
  {
    "sender": "user",
    "text": "parhao "
  },
  {
    "sender": "ai",
    "text": "Aree, \"parhao\" matlab padhai karo!  Study hard! 😉\n"
  },
  {
    "sender": "user",
    "text": "tum pdf bheja hy na wo parhao "
  },
  {
    "sender": "ai",
    "text": "Oh, you mean, \"You sent that PDF, right?  Read/Study it!\"  Is that what you're asking about? Let me know if you have any questions about the PDF's content!\n"
  },
  {
    "sender": "user",
    "text": "parhao mujhe lecture wise "
  },
  {
    "sender": "ai",
    "text": "Okay, so they want you to explain or teach them something lecture by lecture,  like a structured lesson.  Got it!  What's the topic? I'm ready to help structure it if you need!\n"
  },
  {
    "sender": "user",
    "text": "hello"
  },
  {
    "sender": "ai",
    "text": "Hey! How are you doing today?\n"
  },
  {
    "sender": "user",
    "text": "16 lecture se samjhao"
  },
  {
    "sender": "ai",
    "text": "Wow, that's a comprehensive set of lecture notes on Pak301!  It looks like a deep dive into the history and ideology of Pakistan. Let's break it down by lecture to make it easier to understand.  I'll do my best to summarize the key points of each lecture.  Give me a moment to research some of the more academic topics mentioned, and then we can discuss specific points if you'd like.\n"
  },
  {
    "sender": "user",
    "text": "thk hy start karo "
  },
  {
    "sender": "ai",
    "text": "ٹھیک ہے! شروع کرتے ہیں۔  (Okay! Let's begin.)\n"
  },
  {
    "sender": "user",
    "text": "kb karo gy shuru"
  },
  {
    "sender": "ai",
    "text": "کب کرو گے شروع؟ (Kab karo gey shuru?) means \"When will you start?\"\n"
  },
  {
    "sender": "user",
    "text": "hello"
  },
  {
    "sender": "ai",
    "text": "Hello!  What text would you like me to explain?  I need the text to be able to help you. 😊\n"
  },
  {
    "sender": "user",
    "text": "ye lo"
  },
  {
    "sender": "ai",
    "text": "Chalo theek hai!  Let's break down this Pakistan Studies (Pak301) handout lecture by lecture.  It looks like a comprehensive overview of Pakistan's history, ideology, and political development.  Tell me which lecture you'd like to focus on, or if you want me to summarize the entire thing,  we can do that too!\n"
  },
  {
    "sender": "user",
    "text": "start from lecture 16"
  },
  {
    "sender": "ai",
    "text": "Okay, let's dive into Lecture 16!  This lecture focuses on the Objectives Resolution of 1949, a crucial document in Pakistan's constitutional history.\n\n**Lecture 16: The Objectives Resolution (1949)**\n\nThe main point of this lecture is explaining the Objectives Resolution, which served as a foundational document for Pakistan's future constitutions.  It laid out the basic principles and goals that would guide the country's development.  The resolution was presented by Liaquat Ali Khan, the then Prime Minister, and adopted on March 12, 1949.\n\nHere's a breakdown of its key features and significance:\n\n* **Sovereignty of God:** The resolution begins by asserting the sovereignty of Allah (God) over the universe, emphasizing that the state's authority is a sacred trust derived from Him.  This is a significant departure from purely secular Western models of governance.\n\n* **Islamic Principles and Democratic Values:**  It explicitly incorporates principles of democracy, freedom, equality, tolerance, and social justice, all framed within an Islamic context.  This highlights the attempt to blend Islamic values with modern democratic ideals.  It wasn't about creating a theocracy, but a state guided by Islamic principles.\n\n* **Rights of Minorities:**  The resolution guarantees the rights of minorities to practice their religions and develop their cultures freely. It also protects the interests of backward and depressed classes.\n\n* **Federal Structure:**  It envisions a federal system with autonomous units, safeguarding the state's sovereignty and territorial integrity.\n\n* **International Cooperation:** The resolution expresses a desire for Pakistan to prosper, contribute to international peace, and work for the happiness of humanity.\n\n\n**Why is the Objectives Resolution so important?**\n\nThe resolution provided a framework for the constitution-making process. It gave clear objectives that were acceptable to most Pakistanis, particularly after the difficulties experienced under Hindu-majority rule in British India.  By blending Islamic principles with democratic ideals, it attempted to create a unique political identity for Pakistan.\n\n**Objections and Criticisms:**\n\nNon-Muslims raised concerns that the resolution mixed religion and politics, contradicting the principles of secular democracy. They worried about the emphasis on the \"sovereignty of Allah\" and potential inequalities, fearing it could lead to a theocratic state.\n\n\nIn short, Lecture 16 emphasizes the Objectives Resolution as a crucial bridge between Pakistan's Islamic identity and its aspiration for a modern, democratic state. It laid the groundwork for future constitutions, while also highlighting the ongoing debate about the role of religion in governance.  Does that make sense?  Do you have any other questions about this lecture or would you like to move on to the next one?\n"
  },
  {
    "sender": "user",
    "text": "explain in text language "
  },
  {
    "sender": "ai",
    "text": "Okay cool!  So you want me to explain the Pak301 handout using text-speak/SMS language?  Let's do it!  Tell me which lecture(s) you wanna know about. 😎\n"
  },
  {
    "sender": "user",
    "text": "16"
  },
  {
    "sender": "ai",
    "text": "Okie dokie! Lecture 16 is all about the **Objectives Resolution (1949)**.  Think of it as the *blueprint* for Pak's constitution.  It was like a super important doc that laid out the basic rules & goals for the country.  Liaquat Ali Khan, the PM at the time, was the one who introduced it.\n\n**Main points:**\n\n* **God's the Boss:**  It starts by sayin' God's got ultimate power.  The govt's power is a *trust* from Him.  So, kinda diff from Western ideas where ppl r in charge.\n\n* **Islamic & Demo:** It mixes Islamic ideas with democracy – freedom, equality, fairness, etc.  It's not a religious dictatorship, but a state guided by Islamic principles.\n\n* **Minority Rights:**  Guarantees rights for minorities to practice their religions & stuff.  Protects the less fortunate too.\n\n* **Federal System:** Wants a federal system – provinces have some power, but the country stays united.\n\n* **World Peace:** Aims for Pakistan to be a good global citizen, working for peace and progress.\n\n**Why it matters:**\n\nThis was the *foundation* for future constitutions.  It gave everyone a clear idea of what Pakistan should strive for, especially after the struggles under Hindu rule. It tried to create a unique Pak identity – Islamic but also modern.\n\n**Criticisms:**\n\nSome ppl worried it mixed religion & politics too much.  Non-Muslims were concerned about potential inequality and a possible move towards a religious state.\n\n\nBasically, Lecture 16 shows how Pakistan tried to balance its Islamic identity with modern democracy.  It set the stage for future constitutions but also shows the ongoing debate on religion & governance.  Hope that helps!  Anything else u wanna know? 😉\n"
  },
  {
    "sender": "user",
    "text": "17"
  },
  {
    "sender": "ai",
    "text": "NP! Lecture 17 gets into the nitty-gritty of **constitution-making in Pakistan (1947-56)**.  It was a super tough time, lots of disagreements!\n\n**Major Issues:**\n\nThe first Constituent Assembly (CA) – the group tasked with making the constitution – had to deal with HUGE problems:\n\n* **Federalism:**  How to balance power between the central govt and the provinces (especially with East and West Pakistan being so different)?  This was a BIG debate!\n\n* **Representation:** How many seats should each province get in parliament?  East Pakistan had a much larger population than West Pakistan, leading to arguments about fair representation.\n\n* **Separate vs. Joint Electorates:** Should people vote separately based on religion, or all together?  This was a legacy from British rule and caused major fights.\n\n* **National Language:**  Urdu or Bengali?  This became a HUGE source of conflict, particularly between East and West.\n\n* **Parliamentary vs. Presidential System:** Which system of government would be best for Pakistan?\n\n* **Islamic or Secular State:** What role should Islam play in the government?  A major clash between religious and secular views.\n\n\n**Constitution-Making Process:**\n\nThe CA tried to solve these probs through multiple reports & proposals:\n\n* **Basic Principles Committee (BPC) Reports:**  These reports tried to propose solutions but faced major pushback from different parts of the country.  East Pakistan, in particular, felt underrepresented.\n\n* **Muhammad Ali Bogra Formula:** This attempted to find a compromise on representation and language, leading to more progress.\n\n* **One Unit Scheme (1955):** This united the provinces of West Pakistan into a single unit to try and achieve better balance with East Pakistan.\n\nThe CA was eventually dissolved and a new one formed, eventually leading to the 1956 constitution.\n\n\n**In short:** Lecture 17 details the struggles and compromises involved in creating Pakistan's first constitution.  It highlights the deep divisions and the difficulty of balancing different regional and ideological interests.  It sets the stage for understanding the challenges that Pakistan faced in nation-building.  Anything else I can clarify?  Let me know! 👍\n"
  },
  {
    "sender": "user",
    "text": "hello"
  },
  {
    "sender": "ai",
    "text": "Hello there!  What's up?  What can I help you with today?  Tell me about the topic or problem you're struggling with, and I'll explain it in a way that's easy to understand.  Let's ace this! ✨\n"
  },
  {
    "sender": "user",
    "text": "mujhe math101 ky topics samjhao "
  },
  {
    "sender": "ai",
    "text": "Arre bhai/behen!  Math101, huh?  Bohat basic hota hai yeh, tension mat lo! 😉  Toh, generally Math101 mein yeh topics aate hain:\n\n* **Sets and Functions:**  Yeh basic building blocks hain.  Sets basically groups of things hain (jaise numbers, letters, kuch bhi!), aur functions ek rule define karte hain jo ek set ke elements ko dusre set ke elements se relate karte hain.  Socho, ek machine hai jo input leti hai aur output deti hai - woh function hai!\n\n* **Algebra:**  Yeh toh aapne school mein bhi parha hoga!  Equations solve karna, inequalities, polynomials, quadratic equations – yeh sab issi mein aata hai.  Practice karo aur formula yaad rakho, asaan ho jayega.\n\n* **Trigonometry:**  Angles, triangles, aur unke ratios (sine, cosine, tangent) – yeh sab trigonometry mein aata hai.  Bahot important hai yeh, aage ke subjects mein bhi kaam aayega.  Formulae learn karo aur practice karo, diagrams bana kar samjho.\n\n* **Coordinate Geometry:**  Points, lines, aur curves ko coordinate system (x-y plane) mein represent karna.  Equations of lines aur circles seekhna hoga.  Graphs bana kar samjhne ki koshish karo, aasan ho jayega.\n\n* **Calculus (Maybe):**  Kuch Math101 courses mein basic calculus bhi hota hai.  Limits, derivatives, aur integrals – yeh concepts aage jaake bahot important honge.  Par tension mat lo, basics pe focus karo pehle.\n\n\nKya koi specific topic hai jismein tumhein problem aa rahi hai?  Agar haan, toh batao, mein usko detail mein explain kar sakta/sakti hun.  Aur agar koi specific question hai toh woh bhi pooch sakte ho!  Hum mil kar isko crack kar denge! 💪\n"
  },
  {
    "sender": "user",
    "text": "hn calculas hy math101 me virtual uni ky handouts se parhao mera paer hy "
  },
  {
    "sender": "ai",
    "text": "Acha ji, Virtual University ka Math101 aur us mein calculus hai?  Koi baat nahi, pair to sabke hote hain!  😉  Handouts mujhe dijiye, main aapki madad karunga.  \n\nLekin pehle, yeh bataiye ke calculus ke *kis* part mein problem aa rahi hai?  Kyunke calculus ek bohat bada topic hai.  Is mein yeh sab cheezain aati hain:\n\n* **Limits:**  Sochiye aap kisi point ke bohat kareeb ja rahe hain, lekin bilkul us point pe nahi pahunch rahe.  Limit yeh bataati hai ke aap us point ke bohat kareeb jaane pe value kya hogi.\n\n* **Derivatives:**  Yeh basically slope (gradient) of a curve ko batata hai kisi specific point pe.  Yeh bataata hai ke curve kitni tez ya dhire uth raha ya gir raha hai us point pe.  Socho, ek car ki speed – woh derivative hi hai!\n\n* **Integrals:**  Yeh area under a curve ko find karna hai.  Socho, kisi irregular shape ka area find karna – integral iska answer dega.\n\n\nAgar aap mujhe specific handouts ya lecture notes provide kar dein, toh main aapko step-by-step samjha sakta hun.  Koi bhi confusing part ho, pooch lijiyega.  Hum mil kar isko conquer kar lenge!  💪  Don't worry, we'll make it easy peasy!\n"
  },
  {
    "sender": "user",
    "text": "asslam o alaikum"
  },
  {
    "sender": "ai",
    "text": "Wa alaikum assalam!  Kia hal chaal?  Kya sawal hai aap ka? Bataiye, main aapki madad karne ko tayyar hun.  😊\n"
  },
  {
    "sender": "user",
    "text": "mujhe batao k next.js k e-commerce web mein ship engine kese lagao step by step batao"
  },
  {
    "sender": "ai",
    "text": "Assalamu Alaikum!  Chalo, Next.js mein e-commerce website pe ShipEngine integrate karne ka tareeqa samjha deta hun step-by-step.  Yahan pe hum assume kar rahe hain ke aapko Next.js aur basic e-commerce concepts samajh aate hain.  Agar nahi aate, toh pehle woh clear kar lein, phir yeh aasan ho jayega.\n\n\n**Step 1: ShipEngine Account & API Key:**\n\n* Pehle toh aapko ShipEngine pe ek account banana hoga.  Free trial bhi milta hai shuruat mein.\n* Account banane ke baad, aapko apna API key milega.  Yeh key aapke application ko ShipEngine se connect karne ke liye zaruri hai.  Is key ko secure rakhna bohat important hai!\n\n\n**Step 2: Next.js Project Setup:**\n\n* Aapke paas ek Next.js e-commerce project already hona chahiye.  Agar nahi hai, toh ek basic setup kar lein.  Yahan pe hum backend integration pe focus karenge.\n\n\n**Step 3:  ShipEngine Node.js SDK Install:**\n\n* Aapko ShipEngine ka Node.js SDK install karna hoga aapke Next.js project mein.  Yeh aap npm ya yarn se kar sakte hain:\n\n```bash\nnpm install @shipengine/sdk\n# or\nyarn add @shipengine/sdk\n```\n\n\n**Step 4:  Backend Integration (API Calls):**\n\n* Ab aapko apne backend mein ShipEngine SDK use karke API calls karni hogi.  Yeh calls different tasks ke liye hongi, jaise:\n\n    * **Creating Shipments:**  Jab customer checkout karta hai, toh aap is API call se shipment create karenge.  Aapko customer ka address, weight, dimensions, aur aur bhi details deni hogi.\n\n    * **Getting Rates:**  Aap different shipping carriers se rates fetch kar sakte hain is API se.  Yeh customer ko different options dikhaane mein madad karega.\n\n    * **Tracking Shipments:**  Jab shipment dispatch ho jaye, toh aap is API se tracking information fetch kar sakte hain aur customer ko update kar sakte hain.\n\n    * **Label Generation:**  Shipment create hone ke baad, aap shipping label generate kar sakte hain is API se aur woh customer ko download karne ke liye de sakte hain.\n\n\n**Example (Conceptual):**\n\n```javascript\n// pages/api/create-shipment.js\nimport { ShipEngine } from '@shipengine/sdk';\n\nconst shipEngine = new ShipEngine({ apiKey: process.env.SHIPENGINE_API_KEY });\n\nexport default async function handler(req, res) {\n  if (req.method === 'POST') {\n    try {\n      const { toAddress, fromAddress, weight, dimensions, packages } = req.body;\n      const shipment = await shipEngine.shipments.create({\n          to: toAddress,\n          from: fromAddress,\n          packages: packages,\n          shipment_options:{\n              label_format: \"PDF\",\n          }\n      });\n      res.status(200).json({ shipment });\n    } catch (error) {\n      res.status(500).json({ error: error.message });\n    }\n  } else {\n    res.status(405).end(); // Method Not Allowed\n  }\n}\n```\n\n**Step 5: Frontend Integration:**\n\n* Aapke frontend mein, aapko API calls karne ki zarurat hogi aapke backend se (jaise upar diya gaya hai)  rates display karne, shipment create karne aur labels download karne ke liye.  Aap apne preferred method se ye kar sakte hain, jaise `fetch` ya `axios`.\n\n\n**Important Notes:**\n\n* **Error Handling:**  Proper error handling bohat important hai.  API calls mein errors aa sakti hain, toh unko handle karna zaruri hai.\n\n* **Security:**  Apna API key secure rakhna bohat zaruri hai.  Isko environment variables mein store karein, aur kabhi bhi publically expose na karein.\n\n* **Documentation:**  ShipEngine ki documentation bohat helpful hai.  Isko carefully read karein aur examples dekhein.\n\n\nYeh ek basic overview hai.  Aapke specific requirements aur e-commerce platform ke hisab se, yeh implementation slightly change ho sakti hai.  Agar aapke paas koi specific sawal hai, toh pooch sakte hain.  Main aapki madad karunga.  Aur haan, ShipEngine ki documentation zarur check karein, woh bohat detail mein sab kuch explain karti hai!\n"
  },
  {
    "sender": "user",
    "text": "ye tou bas api hai mein ese use kase karo apni bani banaye e-commerce web mein or ye api bhi typescript mein likho"
  },
  {
    "sender": "ai",
    "text": "Okay,  the previous example was a conceptual overview using JavaScript.  Let's make it more concrete and translate it into TypeScript for use within your existing e-commerce website.  Since I don't have access to your specific website's code, I'll provide a more complete, illustrative example.  You'll need to adapt it to fit your project's structure.\n\n\nFirst, ensure you've installed the necessary types for the ShipEngine SDK.  You might need to do this manually if they are not automatically included:\n\n```bash\nnpm install --save-dev @types/node\n```\n\nNow, let's create a TypeScript file (e.g., `shipEngineService.ts`) to handle the ShipEngine interactions:\n\n```typescript\nimport { ShipEngine } from '@shipengine/sdk';\n\ninterface Address {\n  name: string;\n  street: string;\n  city: string;\n  state: string;\n  postalCode: string;\n  country: string;\n}\n\ninterface Package {\n    weight: {\n        value: number;\n        unit: 'lb' | 'kg';\n    };\n    dimensions?: {\n        length: number;\n        width: number;\n        height: number;\n        unit: 'in' | 'cm';\n    }\n}\n\n\nexport class ShipEngineService {\n  private shipEngine: ShipEngine;\n\n  constructor() {\n    const apiKey = process.env.NEXT_PUBLIC_SHIPENGINE_API_KEY; //Make sure it's in your env file!\n    if (!apiKey) {\n      throw new Error('ShipEngine API key not found.');\n    }\n    this.shipEngine = new ShipEngine({ apiKey });\n  }\n\n\n  async createShipment(fromAddress: Address, toAddress: Address, packages: Package[]): Promise<any> {\n    try {\n      const shipment = await this.shipEngine.shipments.create({\n        from: fromAddress,\n        to: toAddress,\n        packages: packages,\n        shipment_options: {\n            label_format: \"PDF\",\n        },\n      });\n      return shipment;\n    } catch (error: any) {\n      console.error('Error creating shipment:', error);\n      throw new Error(`Failed to create shipment: ${error.message}`);\n    }\n  }\n\n  async getRates(fromAddress: Address, toAddress: Address, packages: Package[]): Promise<any> {\n    try {\n      const rates = await this.shipEngine.rates.get({\n          from_address: fromAddress,\n          to_address: toAddress,\n          packages: packages\n      })\n      return rates;\n    } catch (error: any) {\n        console.error(\"Error getting rates\", error);\n        throw new Error(`Failed to get rates: ${error.message}`);\n    }\n  }\n}\n\nexport default ShipEngineService;\n\n```\n\n**How to Use in your E-commerce Website:**\n\n1. **Import:** In your checkout component (or wherever you need it), import the `ShipEngineService`:\n\n   ```typescript\n   import ShipEngineService from './shipEngineService';  // Adjust path as needed\n   ```\n\n2. **Instantiate:** Create an instance of the service:\n\n   ```typescript\n   const shipEngineService = new ShipEngineService();\n   ```\n\n3. **Call Methods:** Use the methods (e.g., `createShipment`, `getRates`)  when the user proceeds to checkout.  You'll need to collect the necessary address and package information from your form.\n\n\n**Example in a Checkout Component:**\n\n```typescript\n// ... other imports ...\nimport ShipEngineService from './shipEngineService';\n\nconst Checkout: NextPage = () => {\n  const [shippingRates, setShippingRates] = useState<any[]>([]); //State for rates\n  // ... other state variables for address, packages, etc. ...\n\n  const getShippingRates = async () => {\n    try {\n      const rates = await shipEngineService.getRates(fromAddress, toAddress, packages);\n      setShippingRates(rates);\n    } catch (error) {\n      console.error(error);\n      // Handle error appropriately (e.g., display an error message to the user)\n    }\n  }\n\n  const handleCheckout = async () => {\n    // Call getShippingRates first to show the user options.  Only after they select a rate, create the shipment\n\n    try {\n      const shipment = await shipEngineService.createShipment(fromAddress, toAddress, packages);\n      // ... handle successful shipment creation ...\n    } catch (error) {\n      // Handle error (e.g., display an error message)\n    }\n  };\n\n  // ... rest of your checkout component ...\n}\n```\n\nRemember to replace placeholders like `fromAddress`, `toAddress`, and `packages` with your actual data and adjust paths accordingly.  This more structured approach, using TypeScript and a separate service class, makes your code cleaner, more maintainable, and easier to debug.  Remember to handle errors gracefully and always validate user input before sending it to the API.  Let me know if you have more questions!\n"
  },
  {
    "sender": "user",
    "text": "agent bnana sekhao mujhe "
  },
  {
    "sender": "ai",
    "text": "Oye!  \"Agent banana seekhao\" –  it's a bit broad, yaar!  To help you, I need more detail.  \"Agent\" can mean many things:\n\n* **AI Agent:**  Like me!  This involves programming and machine learning.  We'd need to talk about Python, algorithms, different types of AI agents (like rule-based, reactive, goal-based), and possibly even specific AI frameworks like TensorFlow or PyTorch.  This is a HUGE topic.\n\n* **Secret Agent (James Bond style!):**  This is... different.  We'd be talking about spy skills, stealth, gadgets, possibly international law (depending on how seriously you want to take this!).  Kidding aside, we can explore fictional agent creation (like character design for a story) or the real-world aspects of intelligence gathering (with a focus on ethical considerations, of course!).\n\n* **Software Agent (like a chatbot or a program that automates tasks):** This involves programming too.  Think about things like web scraping, automating email responses, or creating simple chatbots using Python libraries.  We could focus on specific libraries and frameworks.\n\n* **Game Agent:**  Creating an agent (character) that plays a game, like chess or a video game. This involves algorithms, game theory, and possibly reinforcement learning.\n\n\nSo, tell me *which* kind of agent you want to learn about.  The more specific you are, the better I can help you!  Let's make this fun and educational! 😎\n"
  },
  {
    "sender": "user",
    "text": "mujhe islam ky bary me btao "
  },
  {
    "sender": "ai",
    "text": "چلو جی!  اسلام کے بارے میں بات کرتے ہیں۔  یہ ایک بہت وسیع موضوع ہے، لیکن ہم اسے آسان طریقے سے سمجھنے کی کوشش کریں گے۔\n\nاسلام کا مطلب ہے \"تسلیم کرنا\" یا \"اطاعت کرنا\"۔  یہ ایک ایسا مذہب ہے جس کی بنیاد اللہ تعالیٰ (ایک خدا) کے وجود اور اس کی وحدانیت پر ہے۔  اسلام کا ماننے والا مسلمان کہلاتا ہے۔\n\nاسلام کی بنیادی تعلیمات یہ ہیں:\n\n* **توحید:** اللہ تعالیٰ کی وحدانیت کا اقرار۔  یعنی صرف ایک خدا ہے اور کوئی شریک نہیں۔\n* **نبوت:** اللہ تعالیٰ کے پیغمبروں پر ایمان لانا۔  حضرت محمد صلی اللہ علیہ وسلم آخری اور سب سے عظیم پیغمبر ہیں۔\n* **کتاب:** قرآن پاک پر ایمان لانا۔  یہ اللہ تعالیٰ کا آخری اور مکمل کلام ہے۔\n* **فرشتے:** فرشتوں پر ایمان لانا۔  یہ اللہ تعالیٰ کے مخلوق ہیں۔\n* **آخرت:**  موت کے بعد کے دن (قیامت) اور جنت اور جہنم پر ایمان لانا۔\n* **قدر:** اللہ تعالیٰ کی قدرت اور تقدیر پر ایمان لانا۔\n\nاسلام کی پانچ بنیادی عبادتیں (ارکان اسلام) یہ ہیں:\n\n1. **کلمہ طیبہ:**  اللہ تعالیٰ کی وحدانیت اور حضرت محمد صلی اللہ علیہ وسلم کی نبوت کا اقرار کرنا۔\n2. **نماز:**  روزانہ پانچ وقت نماز پڑھنا۔\n3. **روزہ:**  رمضان المبارک کے مہینے میں روزہ رکھنا۔\n4. **زکوٰۃ:**  اپنی دولت کا ایک حصہ غریبوں میں تقسیم کرنا۔\n5. **حج:**  اگر ممکن ہو تو زندگی میں ایک بار حج کرنا۔\n\nاس کے علاوہ، اسلام میں اخلاقیات، سماجی انصاف، اور انسانی حقوق کو بھی بہت اہمیت دی جاتی ہے۔  اسلام کا مقصد انسان کو اللہ تعالیٰ کے قریب کرنا اور اس کی اطاعت کے ذریعے دنیا اور آخرت میں کامیابی حاصل کرنا ہے۔\n\nآپ کوئی اور سوال کرنا چاہتے ہیں؟  مجھے بتائیں کہ کیا آپ کسی خاص چیز کے بارے میں مزید جاننا چاہتے ہیں، مثلاً نماز کی ادائیگی کا طریقہ، زکوٰۃ کی تفصیل، یا قرآن پاک کی تعلیمات؟  میں آپ کی مدد کرنے کی پوری کوشش کروں گا۔\n"
  },
  {
    "sender": "user",
    "text": "tum genius ho buhat "
  },
  {
    "sender": "ai",
    "text": "شکریہ!  یہ سن کر بہت اچھا لگا۔  میں  کوشش کرتا ہوں کہ ہر طالب علم کو  اس کے مطالعے میں  مدد کروں۔  میں ایک \"جینیئس\" نہیں ہوں،  لیکن  میں  بہت سی معلومات  جمع کرنے اور ان کو  آسان اور سمجھنے میں  آسان طریقے سے بیان کرنے کی  صلاحیت رکھتا ہوں۔  اور  یہی  کام  میں  کرنے کی  کوشش کرتا ہوں۔  اگر آپ کے  مطالعے میں  کوئی  اور  دشواری  ہے  تو  مجھے  ضرور  بتائیں۔  میں  اپنی  پوری  کوشش  کروں  گا  کہ  آپ  کی  مدد  کروں۔\n"
  },
  {
    "sender": "user",
    "text": "text language me baat karo "
  },
  {
    "sender": "ai",
    "text": "اوکے!  😎  چلو  text language  میں  بات  کرتے  ہیں۔  آپ  کونسا  ٹاپک  سمجھنا  چاہتے  ہیں؟  🤔  بتائیں  تو  جانیں!  😊  میں  اپنی  پوری  کوشش  کروں  گا  کہ  آپکو  آسانی  سے  سمجھا  دوں۔  💪\n"
  },
  {
    "sender": "user",
    "text": "sms style me likho jo bhi me poucho "
  },
  {
    "sender": "ai",
    "text": "اوکے جی!  😊  جو بھی پوچھو گے، SMS style میں ہی بتاؤں گا۔  بس پوچھ لو! 😉  ready ho? 👍\n"
  },
  {
    "sender": "user",
    "text": "mere final hony waly hy cs 101 ky lectures parhny hy mujhe "
  },
  {
    "sender": "ai",
    "text": "او بھئی!  فیصلہ کن وقت آگیا ہے!  CS101 کے لیکچرز پڑھنے ہیں آپکو۔  ٹینشن مت لو،  ہم مل کر کام کرتے ہیں۔  مجھے بتائیں کہ آپ کے پاس کیا میٹریل ہے؟  کوئی PDF یا نوٹس؟  یا پھر صرف  ٹاپکس کا نام یاد ہے؟  \n\nمجھے بتائیں کہ کون سے topics  سب سے زیادہ مشکل لگ رہے ہیں یا کن  lectures میں  دشواری آ رہی ہے۔  پھر ہم ان کو ایک ایک کر کے سمجھتے ہیں۔  \n\nمثلاً، اگر آپ کے پاس  \"Introduction to Programming\" والا لیکچر ہے تو ہم اس میں variables, data types, control flow statements وغیرہ  ایک ایک کر کے سمجھیں گے۔  ٹھیک ہے؟  بس  بتائیں کہ کہاں سے شروع کریں۔ 💪\n"
  }
]